InformationRegisters/ЭкипировкаПерсонажей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЭкипировкаПерсонажей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Экипировка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭкипировки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Предметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Предметы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Экипировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредмета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭкипировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЭкипировкаПерсонажей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПредметНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Сообщить("aaAS");	
КонецПроцедуры

&НаКлиенте
Процедура ПредметНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	Отбор = Новый Структура("ТипПредмета", Запись.Экипировка);
	Отбор.Вставить("Игрок", Запись.Игрок);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	Оповещение = Новый ОписаниеОповещения("ВыбранныйПредмет", ЭтаФорма);
	ОткрытьФорму("РегистрНакоплений.РегистрПредметов.ФормаИтогов",ПараметрыФормы,ЭтаФорма,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйПредмет(Предмет, ВторойПараметр) Экспорт
	Если ПроверкаТипаПредмета(Предмет,Запись.Экипировка) тогда
		Запись.Предмет = Предмет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭкипировкаПриИзменении(Элемент)
	Элементы.Предмет.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Функция ПроверкаТипаПредмета(Предмет,ОжидаемыйТип)
	Если Справочники.Предметы.НайтиПоНаименованию(Предмет).ТипПредмета = ОжидаемыйТип тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПредметОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ПроверкаТипаПредмета(ВыбранноеЗначение,Запись.Экипировка) тогда
		Запись.Предмет = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МенюЭкипировки") тогда
		ЭтаФорма.Заголовок = Параметры.МенюЭкипировки;
	КонецЕсли;
	Элементы.Предмет.Видимость = ?(Запись.Экипировка.Пустая(), Ложь, Истина);
КонецПроцедуры  

// выбирать предмет Из Инвентаря а не из справочника предметов
